app/controllers/api/clients_controller.rb

    def index
      # WorkerApprovalGate already blocks non-approved workers before this runs.
      return render json: { error: 'Forbidden' }, status: :forbidden unless current_user&.support_worker
      render json: Client.all.as_json(only: [:id, :first_name, :last_name, :location, :health_conditions], methods: [:age])
---
SELECT "clients".* FROM "clients"